Catalogs/DiscountCards.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>DiscountCards</Name>
			<Comment>Magnetic, barcoded and mixed discount cards</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.DiscountCardKinds</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CardCodeBarcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CardCodeMagnetic</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CardOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Comment>Any additional information</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/CardsTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>CardsTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Magnetic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Barcode</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Mixed</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/DiscountCards/Forms/DuplicatesChoiceForm/Ext/Form/Module.bsl
#Region FormEventsHandlers

// Procedure - OnCreateAtServer event handler.
//
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	ThisForm.Title =  NStr("en = 'Duplicates list by barcode (magnetic code) and card kind'");
							
	Query = New Query;
	Query.Text = 
		"SELECT ALLOWED
		|	DiscountCards.Ref AS DiscountCard,
		|	DiscountCards.Description,
		|	DiscountCards.CardCodeBarcode,
		|	DiscountCards.CardCodeMagnetic,
		|	DiscountCards.CardOwner,
		|	CASE
		|		WHEN DiscountCards.CardCodeBarcode = &CardCodeBarcode
		|			THEN TRUE
		|		ELSE FALSE
		|	END AS FoundByBarcode,
		|	CASE
		|		WHEN DiscountCards.CardCodeMagnetic = &CardCodeMagnetic
		|			THEN TRUE
		|		ELSE FALSE
		|	END AS FoundByMagneticCode,
		|	DiscountCards.Owner AS KindDiscountCard,
		|	CASE
		|		WHEN DiscountCards.DeletionMark
		|			THEN 4
		|		ELSE 1
		|	END AS Picture
		|FROM
		|	Catalog.DiscountCards AS DiscountCards
		|WHERE
		|	DiscountCards.Owner = &Owner
		|	AND (DiscountCards.CardCodeBarcode = &CardCodeBarcode
		|				AND &CheckBarcode
		|			OR DiscountCards.CardCodeMagnetic = &CardCodeMagnetic
		|				AND &CheckMagneticCode)
		|	AND DiscountCards.Ref <> &Refs";
	
	Query.SetParameter("Owner", Parameters.Owner);
	Query.SetParameter("CardCodeMagnetic", Parameters.CardCodeMagnetic);
	Query.SetParameter("CardCodeBarcode", Parameters.CardCodeBarcode);
	Query.SetParameter("Ref", Parameters.Ref);
	Query.SetParameter("CheckBarcode", (Parameters.Owner.CardType = Enums.CardsTypes.Barcode OR Parameters.Owner.CardType = Enums.CardsTypes.Mixed) AND 
	                                               ValueIsFilled(Parameters.CardCodeBarcode));
	Query.SetParameter("CheckMagneticCode", (Parameters.Owner.CardType = Enums.CardsTypes.Magnetic OR Parameters.Owner.CardType = Enums.CardsTypes.Mixed) AND 
	                                               ValueIsFilled(Parameters.CardCodeMagnetic));
	
	Result = Query.Execute();
	DuplicatingDiscountCardsTables.Load(Result.Unload());
	
EndProcedure

#EndRegion

#Region FormItemEventsHandlers

// Procedure - event handler Selection in value table DuplicatesList. Opens the form of selected discount card.
//
&AtClient
Procedure DuplicatesListSelection(Item, SelectedRow, Field, StandardProcessing)
	
	StandardProcessing = False;
	
	TransferParameters = New Structure("Key", Item.CurrentData.DiscountCard);
	TransferParameters.Insert("CloseOnOwnerClose", True);
	
	OpenForm("Catalog.DiscountCards.ObjectForm",
				  TransferParameters, 
				  Item,
				  ,
				  ,
				  ,
				  New NotifyDescription("HandleItemEdit", ThisForm));
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

// Procedure is called when closing discount card form. Opening the form is called from procedure DuplicatesListSelection 
//
&AtClient
Procedure HandleItemEdit(ClosingResult, AdditionalParameters) Export
	Items.DuplicatingDiscountCardsTables.Refresh();
EndProcedure

#EndRegion
